Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs.PaneId
The identifier for dockable pane.
Since:
2015

Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs.DockableFrameShown
True if the pane is being shown, false if it is being hidden.
Since:
2015

Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs
The event arguments used by the DockableFrameVisibilityChanged event.
Since:
2015